#pragma once

#include "bn_sprite_font.h"
#include "bn_utf8_characters_map.h"
#include "bn_sprite_items_font_normal.h"

namespace font {
    // ¡«°»¿ÀÁÂÃÄÆÇÈÉÊËÌÍÎÏÑÒÓÔÕÖ×ÙÚÛÜàáâãäæçèéêëìíîïñòóôõöùúûüýÿŸŒœδ☆♀♂ Ӕӕ
    constexpr bn::utf8_character font_utf8_characters[] = {
        "¡",
        "¿",
        "À",
        "Á",
        "Â",
        "Ã",
        "Ä",
        "Ç",
        "È",
        "É",
        "Ê",
        "Ë",
        "Ì",
        "Í",
        "Î",
        "Ï",
        "Ñ",
        "Ò",
        "Ó",
        "Ô",
        "Õ",
        "Ö",
        "×",
        "Ù",
        "Ú",
        "Û",
        "Ü",
        "ß",
        "à",
        "á",
        "â",
        "ã",
        "ä",
        "ç",
        "è",
        "é",
        "ê",
        "ë",
        "ì",
        "í",
        "î",
        "ï",
        "ñ",
        "ò",
        "ó",
        "ô",
        "õ",
        "ö",
        "ù",
        "ú",
        "û",
        "ü",
        "ý",
        "ÿ",
        "Ÿ",
        "δ",
        "★",
        "♀",
        "♂"
    };

    constexpr int8_t font_character_widths[] = {
    3, // 32
    4, // 33 !
    6, // 34 "
    0, // 35 # unused
    7, // 36 $
    0, // 37 % unused
    7, // 38 &
    3, // 39 '
    3, // 40 (
    3, // 41 )
    0, // 42 * unused
    7, // 43 +
    3, // 44 ,
    6, // 45 -
    4, // 46 .
    7, // 47 /
    7, // 48 0
    7, // 49 1
    7, // 50 2
    7, // 51 3
    7, // 52 4
    7, // 53 5
    7, // 54 6
    7, // 55 7
    7, // 56 8
    7, // 57 9
    4, // 58 :
    4, // 59 ;
    7, // 60 <
    7, // 61 =
    7, // 62 >
    7, // 63 ?
    0, // 64 @ unused
    6, // 65 A
    6, // 66 B
    6, // 67 C
    6, // 68 D
    6, // 69 E
    6, // 70 F
    6, // 71 G
    6, // 72 H
    6, // 73 I
    6, // 74 J
    6, // 75 K
    6, // 76 L
    6, // 77 M
    6, // 78 N
    6, // 79 O
    6, // 80 P
    6, // 81 Q
    6, // 82 R
    6, // 83 S
    6, // 84 T
    6, // 85 U
    6, // 86 V
    6, // 87 W
    6, // 88 X
    6, // 89 Y
    6, // 90 Z
    0, // 91 [ unused
    0, // 92   unused
    0, // 93 ] unused
    0, // 94 ^ unused
    7, // 95 _
    0, // 96 ` unused
    6, // 97 a
    6, // 98 b
    6, // 99 c
    6, // 100 d
    6, // 101 e
    6, // 102 f
    6, // 103 g
    6, // 104 h
    4, // 105 i
    6, // 106 j
    6, // 107 k
    4, // 108 l
    6, // 109 m
    6, // 110 n
    6, // 111 o
    6, // 112 p
    7, // 113 q
    5, // 114 r
    6, // 115 s
    6, // 116 t
    6, // 117 u
    6, // 118 v
    6, // 119 w
    7, // 120 x
    6, // 121 y
    7, // 122 z
    0, // 123 { unused
    0, // 124 | unused
    0, // 125 } unused
    0, // 126 ~ unused
    3, // ¡
    7, // ¿
    6, // À
    6, // Á
    6, // Â
    6, // Ã
    6, // Ä
    6, // Ç
    6, // È
    6, // É
    6, // Ê
    6, // Ë
    6, // Ì
    6, // Í
    6, // Î
    6, // Ï
    6, // Ñ
    6, // Ò
    6, // Ó
    6, // Ô
    6, // Õ
    6, // Ö
    6, // ×
    6, // Ù
    6, // Ú
    6, // Û
    6, // Ü
    6, // ß
    6, // à
    6, // á
    6, // â
    6, // ã
    6, // ä
    6, // ç
    6, // è
    6, // é
    6, // ê
    6, // ë
    4, // ì
    4, // í
    4, // î
    4, // ï
    6, // ñ
    6, // ò
    6, // ó
    6, // ô
    6, // õ
    6, // ö
    6, // ù
    6, // ú
    6, // û
    6, // ü
    6, // ý
    6, // ÿ
    6, // Ÿ
    6, // δ
    6, // ★
    6, // ♀
    6, // ♂
    };

    constexpr bn::span<const bn::utf8_character> font_normal_utf8_characters_span(font_utf8_characters);
    constexpr auto font_utf8_characters_map = bn::utf8_characters_map<font_normal_utf8_characters_span>();
    constexpr bn::sprite_font font(bn::sprite_items::font_normal, font_utf8_characters_map.reference(), font_character_widths);
}